#!../bin/zsp    --。
我的文件、‘参数0’、在、目录、名、副名、类型、绝对、大小、修改时间、2006-01-02-15-04、权限。换行。

赋予1、2以我的文件、1.2.3.4、主名、副名。
(‘1’)(‘2’)换行。

定义“====”以下代码
	(先我的‘参数1’、‘参数栈2’了)“ ‘参数栈’”换行
上代码。

====文件、先我的环境变量、HOME了/../../////.//////vmlinuz、净。

====文件、.、绝对。

====文件、、主名。
====文件、.、主名。
====文件、.、副名。
====文件、1.2.3.4.5、主名。
====文件、1.2.3.4.5、副名。
====文件、.1、主名。
====文件、.1、副名。

定义“===”以下代码
	====文件、‘参数1’、类型
上代码。
===/。
===/_no。
===/dev/fb0。

定义“===”以下代码
	====合适文件名、‘参数栈’
上代码。
===/boot/grub/、/boot。
===/boot/abi-3.13.0-43-generic、/boot。
===/tmp/00013、/tmp。
===/tmp/.X0-lock、/tmp。
