#!../bin/zsp --。
赋予以“Hello 世界！123 Go.”。‘’换行。

我的正则迭、‘’、(.).(.).(.)、下代码
	‘参数’-。
上代码。
换行。

定义--以下代码
	别名式以参数1。
	我的正则代、‘’、‘式’、下代码
		‘参数1’-。
	上代码。
	-‘式’换行。
上代码。

--[[:^ascii:]]+。
--[\P{Han}]+。
--(?U)\b.+\b。
--(?:Hell|G)o。

定义--以下代码
	别名式以参数1。
	别名格以参数2。
	别名串以参数3。
	如果不存在串那么别名串以。
	我的正则格、‘串’、‘式’、‘格’。
	我的迭代、下代码
		“--‘参数1’”
	上代码、‘参数栈’。
	换行。
上代码。

--(?PHell|G)o、${n}ooo。
--(Hello)(.*)(Go)、$3$2$1。
--[^:]+(.+)、127.0.0.1$1、10.0.2.15:4003。

我的正则迭、“-volume 0 -fs”、“-fs|-volume (\d+)”、下代码
	/‘参数’。
上代码。
换行。

我的正则迭、abcd、(\w)、下代码
	如果‘参数1’等于b那么再来。
	如果‘参数1’大于c那么跳出。
	‘参数’。
上代码。

定义啊啊以下代码
	22.。
	我的正则迭、‘参数’、“(.+)”、下代码
		‘参数’。
		退出。
	上代码。
	1.。
上代码。
啊啊。啊啊333.。前面该有333.。
换行。
